test/data/xml/pelco/SetPreset.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:env="http://www.w3.org/2003/05/soap-envelope " 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:xs="http://www.w3.org/2001/XMLSchema" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl">
  <s:Header>
    <Security s:mustUnderstand="1" 
      xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>admin</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">UP1n3sJM0ne2X4eh1zGcKXYZZ9M=</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">GOJ0X+iv5ExUcbcQXXXLpg==</Nonce>
        <Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2018-02-15T15:41:01.289Z
        </Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <tptz:SetPreset>
      <tptz:ProfileToken>0</tptz:ProfileToken>
      <tptz:PresetName>testPreset</tptz:PresetName>
    </tptz:SetPreset>
  </s:Body>
</s:Envelope>